# Упражнение 6: Фильтр чисел
# ---------------------------
# Дан список чисел: [3, 7, 12, 5, 20, 8, 15].
# Создай новый список, содержащий только числа больше 10.
# Используй генератор списка с условием.
# Подсказка: [x for x in список if условие]

l = [3, 7, 12, 5, 20, 8, 15]

print([x for x in l if x > 10 ])
